backwardStep_turbulent/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions

restore0Dir

# runApplication blockMesh
runApplication blockMesh -dict system/blockMeshDictBacwardStep

runApplication simpleFoam

touch case.foam