backwardStep_turbulent/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      5;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

    #includeFunc "pressureCoefficient"
    // #includeFunc "sample"
    // #includeFunc "sampleCp"
    #includeFunc "wallShearStress"

    // Co1
    // {
    //     type                CourantNo;
    //     libs                (fieldFunctionObjects);

    //     executeControl      timeStep;
    //     executeInterval     100;
    //     writeControl        timeStep;
    //     writeInterval       100;

    // }

}

// ************************************************************************* //
