backwardStep_turbulent/system/pressureCoefficient
type            pressure;
libs            (fieldFunctionObjects);

writeControl    writeTime;

mode            staticCoeff; // modo de calculo coeficiente presión estática

// modes: 
// static      | static pressure
// total       | total pressure
// isentropic  | isentropic pressure
// staticCoeff | static pressure coefficient
// totalCoeff  | total pressure coefficient


result          cp; // nombre del campo guardado

rho             rhoInf; // nombre del campo de densidad
rhoInf          1; // densidad de corriente libre
pInf            0; // presión total de referencia
UInf            (42 0 0); // velocidad de corriente libre
