backwardStep_turbulent/system/samplePatch
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
writeFields     true;

surfaceFormat   raw;
regionType      patch;
name            lowerWall;

operation       none;

fields
(
    p
);